---
type: ExternalServiceId
namespace: Autodesk.Revit.DB.ExternalService
version: 2024
members: 1
tags: [revit-api, class]
---

# ExternalServiceId

`Autodesk.Revit.DB.ExternalService.ExternalServiceId` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExternalServiceId | — | `public ExternalServiceId ( Guid guid )` |